dic_hindi = {0:"",1:"एक",2:"दो",3:"तीन",4:"चार",5:"पांच",6:"छह",7:"सात",8:"आठ",9:"नौ",10:"दस",
11:"ग्यारह",12:"बारह",13:"तेरह",14:"चौदह",15:"पंद्रह",16:"सोलह",17:"सत्रह",18:"अठारह",19:"उन्नीस",20:"बीस",21:"इकीस",22:"बाईस",23:"तेइस",
24:"चौबीस",25:"पच्चीस",26:"छब्बीस",27:"सताइस",28:"अट्ठाइस",29:"उनतीस",30:"तीस",31:"इकतीस",32:"बतीस",33:"तैंतीस",34:"चौंतीस",35:"पैंतीस",36:"छतीस",
37:"सैंतीस",38:"अड़तीस",39:"उनतालीस",40:"चालीस",41:"इकतालीस",42:"बयालीस",43:"तैतालीस",44:"चवालीस",45:"पैंतालीस",46:"छयालिस",47:"सैंतालीस",
48:"अड़तालीस",49:"उनचास",50:"पचास",51:"इक्यावन",52:"बावन",53:"तिरपन",54:"चौवन",55:"पचपन",56:"छप्पन",57:"सतावन",58:"अठावन",59:"उनसठ",
60:"साठ",61:"इकसठ",62:"बासठ",63:"तिरसठ",64:"चौंसठ",65:"पैंसठ",66:"छियासठ",67:"सड़सठ",68:"अड़सठ",69:"उनहतर",70:"सत्तर",71:"इकहतर",
72:"बहतर",73:"तिहतर",74:"चौहतर",75:"पचहतर",76:"छिहतर",77:"सतहतर",78:"अठहतर",79:"उन्नासी",80:"अस्सी",81:"इक्यासी",82:"बयासी",83:"तिरासी",
84:"चौरासी",85:"पचासी",86:"छियासी",87:"सतासी",88:"अट्ठासी",89:"नवासी",90:"नब्बे",91:"इक्यानवे",92:"बानवे",93:"तिरानवे",94:"चौरानवे",95:"पचानवे",
96:"छियानवे",97:"सतानवे",98:"अट्ठानवे",99:"निन्यानवे",100:"एक सौ"}

# print(dic_hindi)
l1 = []
list_hindi = ["हज़ार","लाख","करोड़"]
strg = ""
number = ""
l2 = ""
def conv_hindi(num):
    global strg
    global number
    global l2
    a = str(num)

    dotop = ""
    if('.' in a):
        b = a.index('.')
        dotop = a[b+1: :] + "/100"
        a = a[0:b:]

    a = '0' + a[0: :] if(len(a)%2==0) else a
    for i in range(len(a),0,-1):
        if(i == len(a)-1):
            l1.append(str(a[i-2]) +str(a[i-1]) + str(a[i]))
    i1 = 0
    for j in range(len(a)-3,0,-1):
        if(i1 % 2 != 0):
            l1.append(str(a[j-1]) + str(a[j]))
        i1 += 1


    length = len(l1)
    if(len(l1[0])==3):
        geth = l1[0][0]
        if(geth == '0'):
            number += l1[0][1] + l1[0][2]
            strg += dic_hindi[int(number)]
        else:
            number += l1[0][1] + l1[0][2]
            strg += dic_hindi[int(l1[0][0])] + "सौ" +" "+ dic_hindi[int(number)] + ","
        l1.pop(0)

    for k in range(0,len(l1)):
        strg += dic_hindi[int(str(l1[0][0])+str(l1[0][1]))] +" "+str(list_hindi[0]) + ","
        list_hindi.pop(0)
        l1.pop(0)

    strg1 = strg.split(',')
    strg1.reverse()
    for i in strg1:
        l2 = l2 +" "+i 

    return l2 +" "+dotop


print(conv_hindi(462111511.67))